name: "MNIST"
input: "data"
input_dim: 1
input_dim: 1
input_dim: 28 
input_dim: 28

# BCNN 
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 96
    kernel_size: 11 
    stride: 4
  }
}

layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}

layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  convolution_param {
    num_output: 256 
    kernel_size: 5
    pad: 2 
    group: 2
  }
} 

layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}


layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  bottom: "pool2"
  #top: "fc_finetune"
  #name: "fc_finetune"
  top: "fc"
  name: "fc"
  type: "InnerProduct"
  inner_product_param {
    num_output: 500 
  }
}

layer {
  name: "relu3"
  type: "ReLU"
  #bottom: "fc_finetune"
  #top: "fc_finetune"
  bottom: "fc"
  top: "fc"
}

layer {
  name: "drop"
  type: "Dropout"
  #bottom: "fc_finetune"
  #top: "fc_finetune"
  bottom: "fc"
  top: "fc"
  dropout_param {
    dropout_ratio: 0.5
  }
}



layer {
  #bottom: "fc_finetune"
  #top: "fcf"
  #name: "fcf"
  bottom: "fc"
  top: "fc10"
  name: "fc10"
  type: "InnerProduct"
  inner_product_param {
    num_output: 10 
  }
}


layer {
  name: "prob"
  type: "Softmax"
  #bottom: "fcf"
  bottom: "fc10"
  top: "prob"
}
